app/controllers/appointments_controller.rb

  def new
    @appointment = Appointment.new
    @doctors = Doctor.all
    @users = User.all
---
SELECT "doctors".* FROM "doctors"
SELECT "users".* FROM "users"

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("reason", "length", "important", "user_id", "doctor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["reason", "Stuff"], ["length", 5], ["important", false], ["user_id", 1], ["doctor_id", 1], ["created_at", "2018-05-16 19:20:44.460411"], ["updated_at", "2018-05-16 19:20:44.460411"]]