app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("name", "age", "nurse", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Helen"], ["age", 31], ["nurse", true], ["created_at", "2018-05-16 17:58:14.459208"], ["updated_at", "2018-05-16 17:58:14.459208"]]