app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "age", "school", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Sophie"], ["age", 21], ["school", false], ["created_at", "2018-05-16 17:56:35.627236"], ["updated_at", "2018-05-16 17:56:35.627236"]]